# CouplerLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CouplerLength Property
ParameterTypeId Class See Also
---
"Total Length"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CouplerLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouplerLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CouplerLength {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace